/*
 * Оператор switch
 */

/*
TODO: Напиши скрипт вибору опції доставки товара.
TODO: Опція зберігається в змінній option: 1 - самовивіз, 2 - кур'єр, 3 - пошта
TODO:
TODO: В змінну message потрібно записати повідомлення в залежності від опції.
TODO: - 'Ви можете забрати товар завтра з 12:00 в нашому офісі'
TODO: - 'Кур'єр доставить замовлення завтра з 9:00 до 18:00'
TODO: - 'Посилку буде відправлено сьогодні'
TODO: - 'Вам передзвонить менеджер'
 */

const option = 0;
let message = '';

switch (option) {
  case 1: {
    message = 'Ви можете забрати товар завтра з 12:00 в нашому офісі';

    break;
  }

  case 2: {
    message = 'Курʼєр доставить замовлення завтра з 9:00 до 18:00';

    break;
  }

  case 3: {
    message = 'Посилку буде відправлено сьогодні';

    break;
  }

  default: {
    message = 'Вам передзвонить менеджер';
  }
}

console.log(message);
