/*
 * Функції
 *
 * - Оголошення та виклик функції
 * - Параметри та аргументи
 * - Повернення значення
 * - Порядок виконання коду
 * - Області видимості
 */

/*
TODO: Напишіть функцію getRectArea(sideA, sideB) для обчислення площі прямокутника.
TODO: Сторони прямокутника будуть переденні до параметрів sideA та sideB.
*/

// console.log(getRectArea(8, 11)); // 88
// console.log(getRectArea(18, 11)); // 198
// console.log(getRectArea(8, 21)); // 168

/*
 TODO: Напиши функцію calcBMI(weight, height) яка розраховує та повертає індекс
 TODO: маси тіла людини. Для цього необхідно розділити вагу на
 TODO: квадрат висоти.
 TODO:
 TODO: Вага та висота будуть спеціально передані як рядки.
 TODO:
 TODO: Індекс маси тіла необхідно округлити до однієї цифри після коми.
 */

// function calcBMI(weight, height) {}

// const bmi = calcBMI('88.3', '1.75');

// console.log(bmi); // 28.8
